{"courseCode":"javaee_jaxrs","courseName":"Developing REST APIs with JAX-RS","description":"Now that we've identified some important resource URIs, let's work on the operations that can be performed and the data that's exchanged.","permalinkName":"HTTP-Methods","title":"HTTP Methods","unitSlNo":"1.9","type":"quiz","durationText":"3 questions","slNo":9,"prev":"/courses/javaee_jaxrs/lessons/HTTP-Methods","next":"/courses/javaee_jaxrs/lessons/Idempotence-In-HTTP-Methods","content":"<p>We saw that a URI like <code>getMessages.do?id=10</code> is <em>action-based</em> and not RESTful. We chose the URI <code>/messages/10</code> to replace it. This is resource based and RESTful and all that good stuff. But here&#39;s a problem.</p>\n<p>Look at the URI <code>getMessages.do?id=10</code>. It has 3 pieces of information. </p>\n<ol>\n<li>It refers to messages</li>\n<li>It refers to ID 10</li>\n<li>It <em>gets</em> that information</li>\n</ol>\n<p>Now look at the URI <code>/messages/10</code>. There&#39;s definitely #1 and #2. But the URI does not have the information in point 3.</p>\n<p>You could argue that accessing that URI <em>gets</em> the data for message id 10. But what about other operations? We have looked at just getting data so far. You could have URIs that submit data.</p>\n<p>For example:\n<code>/submitMessage.do?id=10</code> lets you submit something to the message ID 10. What would be the REST URI equivalent for that?</p>\n<p>Well, equivalent resource based REST URI is:\n<code>/messages/10</code></p>\n<p>Yes, that&#39;s right! It&#39;s the same URI.</p>\n<p>How about a delete operation? What would be the equivalent of a URI like <code>/deleteMessage.do?id=10</code>?</p>\n<p>The equivalent is still <code>/messages/10</code>!</p>\n<p>How is that possible? How can the same URI do all these different operations? <em>And how does it know when to do what?</em></p>\n<p>The answer is <strong>HTTP methods</strong>. If you want your API client to perform different operations for message 10, just have them use different HTTP methods to the same URI <code>/messages/10</code>! </p>\n<p>The most common HTTP methods are:</p>\n<ol>\n<li>GET</li>\n<li>POST</li>\n<li>PUT</li>\n<li>DELETE</li>\n</ol>\n<p>There are some other methods that are rarely used like HEAD and OPTIONS. But for the most part, we&#39;ll focus on the 4 common HTTP methods in this course.</p>\n<p>These HTTP methods have specific meanings, and you typically use the right method for the right operation. Also, when using HTTP, like when you are browsing a web page, you are actually using these methods automatically. When you type in a URL in the address bar of your browser, the browser automatically issues a GET request for that URL. When you submit a form, the browser probably uses a POST request to do so. The idea is to use the right methods depending on the operation. Choosing methods for a RESTful API also follows the same idea.</p>\n<p>So, for example, in the REST world, you do not make a call to <code>getProducts</code>. You make a GET request to the products resource URI. You do not call <code>deleteOrder</code>. You make a DELETE request to the order resource URI. The URI tells you what <em>entity</em> or resource is being operated upon and the method tells you what the operation is.</p>\n<h2 id=\"scenarios\">Scenarios</h2>\n<p>Let us look at some of the common operations in our sample social media application and identify the HTTP methods for each of them.</p>\n<h4 id=\"getting-a-message\">Getting a message</h4>\n<p>This should be obvious now. The URI is the resource URI that you need to get. the HTTP method is GET, since you are literally <em>getting</em> the information</p>\n<p>Example: <code>GET /messages/20</code> returns the message ID 20.</p>\n<h4 id=\"updating-a-message\">Updating a message</h4>\n<p>Let&#39;s say our social media application lets you make changes to messages you&#39;ve already submitted. We anticipate this feature of our Messenger application will be very popular  among some  celebrities and politicians who&#39;d sometimes like to retract what they&#39;ve already posted. </p>\n<p>What&#39;s the right method for submitting an updated message. Is it the POST method? This one is not all that obvious. You <em>can</em> use POST, and I know some people do, but the standard practice is to use the PUT method. Why PUT and not POST? There is a very important difference between two, and I&#39;ll talk about that a bit later. But for now, remember that we&#39;ll be using PUT to <em>update</em>  or <em>change</em> any resource. </p>\n<p>Of course, you&#39;ll want the resource to be updated with something. The new content. That content needs to be sent in the body of the PUT request. </p>\n<p>Example: <code>PUT /messages/20</code> (with the request body containing the new message content) replaces the message ID 20 with the content in the request body.</p>\n<h4 id=\"deleting-a-message\">Deleting a message</h4>\n<p>This one should be easy. Yes, there is a DELETE method, and that&#39;s what you should use here. When you want your clients to delete a resource, just have them issue a DELETE request to the resource URI.  No request body required.</p>\n<p>Example: <code>DELETE /messages/20</code> deletes message ID 20.</p>\n<h4 id=\"creating-a-new-message\">Creating a new message</h4>\n<p> This one is interesting. Before we talk about the method to use, think about what URI to call to create a new message. To get, change or delete a message, you used the message resource URI <code>/messages/{messageId}</code>. How about creating a new message? The message hasn&#39;t been created yet, so there is no message ID! And the ID is typically managed by the application, by finding the next unused ID, so the client usually has no idea what the ID will be.</p>\n<p>This is why, requests for creating a new resource is always issued to the collection URI for that resource. To create a new message, the request is made to <code>/messages</code>. To create a new profile, a request is made to <code>/profiles</code>. The application receives this request and creates a new resource and assigns an ID to it.</p>\n<p>With that settled, what will be the HTTP method? For creating resources, the practice is to use a POST method. The POST body will should contain the content for creating the resource.</p>\n<p>Once the resource is created, the service will need to let the client know what the ID is. Because, unless the client knows the ID, there is no way for it to do anything with the newly created resource. So, in the response for the POST request, the web service sends back the ID of the newly created resource.</p>\n<p>Example: <code>POST /messages</code> (with the request body containing the new message) creates a new message with the content in the request body. Response to this request contains the message ID that was created.</p>\n<h2 id=\"collection-uri-scenarios\">Collection URI scenarios</h2>\n<p>You&#39;ll appreciate the elegance and overall awesomeness of REST API practices when you realize how seamlessly these concepts translate to collection URIs.</p>\n<p>Imagine what happens when you make a GET request to a collection URI like <code>/messages</code>. Yes, you get all messages! Other HTTP methods work the same way too. Here are some examples:</p>\n<p>DELETE on <code>/messages/10/comments</code> deletes all comments associated with message 10.</p>\n<p>POST on <code>/messages/10/comments</code> creates a new comment for message ID 10 with the request body containing the new comment information.</p>\n<p>PUT on <code>/messages/20/comments</code> replaces the list of comments for message ID 20 with a new list of comments in the PUT body. (This kind of API is not commonly used though)</p>\n<p>DELETE on <code>/messages</code> deletes all messages (Again, not commonly used, and not something you&#39;d want to implement, I think!)</p>\n<h2 id=\"summary\">Summary</h2>\n<p>There you go. We have identified standard HTTP methods for all the CRUD operations. Whenever you need to provide APIs for creating, deleting, fetching or updating a resource, you know what methods to choose for them.</p>\n<p>This, of course, doesn&#39;t address all the operations. Very rarely do web applications perform just CRUD operations. What if you need to provide an API for archiving a message? Or run a server-side job? How can we map GET, PUT, POST and DELETE methods to those miscellaneous operations?</p>\n<p>The fact is, these methods do not really map to CRUD operations. It does look like that based on what we&#39;ve seen in this tutorial, but there is more to it. We will talk about this in a later tutorial, so hold on to that thought for a bit!</p>\n","topic":"javaee","unit":{"lessons":[{"title":"Introduction","description":"Welcome to this course. This tutorial introduces you to REST APIs and explains some basic concepts.","permalinkName":"Introduction","type":"video","slNo":1,"durationText":"16 minutes"},{"title":"REST and HTTP","description":"In this tutorial, we will learn some HTTP concepts that have influenced REST.","permalinkName":"REST-and-HTTP","type":"video","slNo":2,"durationText":"14 minutes"},{"title":"HTTP Concepts","description":"In this tutorial, we will learn some HTTP concepts that have influenced REST.","permalinkName":"HTTP-Concepts","type":"quiz","slNo":3,"durationText":"5 questions"},{"title":"Designing Resource URIs","description":"In this tutorial, we’ll start designing a sample RESTful API for our sample social media application. And through the process, we’ll understand how RESTful URIs are designed.","permalinkName":"Designing-Resource-URIs","type":"video","slNo":4,"durationText":"18 minutes"},{"title":"Resource URIs","description":"In this tutorial, we’ll start designing a sample RESTful API for our sample social media application. And through the process, we’ll understand how RESTful URIs are designed.","permalinkName":"Resource-URIs","type":"quiz","slNo":5,"durationText":"3 questions"},{"title":"RESTful URI types","description":"You can think of RESTful URIs as belonging to two types: instance resource URIs and collection resource URIs. Let's understand what they mean.","permalinkName":"RESTful-URI-types","type":"video","slNo":6,"durationText":"7 minutes"},{"title":"URI types","description":"You can think of RESTful URIs as belonging to two types: instance resource URIs and collection resource URIs. Let's understand what they mean.","permalinkName":"URI-types","type":"quiz","slNo":7,"durationText":"4 questions"},{"title":"HTTP Methods","description":"Now that we've identified some important resource URIs, let's work on the operations that can be performed and the data that's exchanged.","permalinkName":"HTTP-Methods","type":"video","slNo":8,"durationText":"11 minutes"},{"title":"HTTP Methods","description":"Now that we've identified some important resource URIs, let's work on the operations that can be performed and the data that's exchanged.","permalinkName":"HTTP-Methods","type":"quiz","slNo":9,"durationText":"3 questions"},{"title":"Idempotence In HTTP Methods","description":"Idempotence. Yes, that's a word. And it's an important property of HTTP methods according to the specifications.","permalinkName":"Idempotence-In-HTTP-Methods","type":"video","slNo":10,"durationText":"12 minutes"},{"title":"Rest Response","description":"We've looked at requests so far, and understood resource URIs and HTTP methods. Let's switch to responses now.","permalinkName":"Rest-Response","type":"video","slNo":11,"durationText":"16 minutes"},{"title":"HATEOAS","description":"In this tutorial, we'll learn about an important concept relating to REST APIs: HATEOAS\n","permalinkName":"HATEOAS","type":"video","slNo":12,"durationText":"14 minutes"},{"title":"The Richardson Maturity Model","description":"In this tutorial, we'll learn about the Richardson Maturity Model, a way for REST APIs to be classified, and the \"RESTfulness\" of an API determined.","permalinkName":"The-Richardson-Maturity-Model","type":"video","slNo":13,"durationText":"8 minutes"}]}}