{"courseCode":"javaee_jaxrs","courseName":"Developing REST APIs with JAX-RS","description":"You can think of RESTful URIs as belonging to two types: instance resource URIs and collection resource URIs. Let's understand what they mean.","permalinkName":"RESTful-URI-types","title":"RESTful URI types","unitSlNo":"1.6","youtube":"gYKJqUZXuBw","duration":452,"slNo":6,"prev":"/courses/javaee_jaxrs/lessons/Resource-URIs-Quiz","next":"/courses/javaee_jaxrs/lessons/URI-types","content":"<h2 id=\"uri-types\">URI Types</h2>\n<p>We&#39;ve designed URIs for messages and comments in the previous tutorial. To recap, a message is accessible at:\n<code>/messages/{messageId}</code></p>\n<p>And comments are accessible at:\n<code>/messages/{messageId}/comments/{commentId}</code></p>\n<p>These URIs are great when you want to look up a particular message or a particular comment. These are called instance resource URIs. A single instance of a message or a comment is accessible by the instance resource. Instance resource URIs typically have a unique ID of that resource to identify which instance you are interested in.</p>\n<p>What about if you want all messages?</p>\n<p>The answer is simple. Just access \n<code>/messages</code></p>\n<p>That&#39;s it! Again, this is analogous to a simple static site with HTML pages. Accessing a directory gives you all the contents in that directory. So, think of <code>/messages</code> as the top level directory for all messages and accessing that URI gives a list of all messages.</p>\n<p>Similarly, if you need all comments made for message 2, the URI is: <code>/messages/2/comments</code>. That&#39;s the directory for all comments for message 2.</p>\n<p>These URIs are different from the URIs we saw in the previous tutorial. They do not represent a particular resource, but rather, a collection or a list of resources. So, they are called <em>collection URIs</em>. These URIs pull up a collection of instance resources. </p>\n<p>This also explains why the resource names are in plural. They help the client understand that they are working with a collection of resources with these URIs.</p>\n<p><code>/messages</code> returns all messages\n<code>/profiles</code> returns all profiles\n<code>/messages/{messageId}/comments</code> returns all comments for <code>messageId</code>\n<code>/messages/{messageId}/likes</code> returns all likes for <code>messageId</code>\n<code>/messages/{messageId}/shares</code> returns all shares for <code>messageId</code></p>\n<p>This shows you the advantage of <em>nesting</em> related resources like messages and comments, or messages and likes in this way. But this also brings up a problem. What if you need a list of <em>all</em> comments irrespective of which message they are associated with. This URI is not good enough for that. The way we have designed our URI, you have to give a message ID here. This is where a decision has to be made about how you want resources to be accessed. In this example, I choose to not provide an option for getting all comments. A comment makes sense only in the context of a message, and I don&#39;t want my clients to make requests for all comments. If I needed to provide that functionality, I would design the comments URI like <code>/comments</code> rather than <code>/messages/{messageId}/comments</code>. Again, no right or wrong. This is something you decide.</p>\n<h2 id=\"filtering-collections\">Filtering collections</h2>\n<p>When you have collection URIs like this, you&#39;d want a way to filter the result. It&#39;s not so much a problem for the comments URI. Getting all comments for a message is mostly not going to be a big list, but imagine getting all messages. That&#39;s going to result in a lot of data, and the client who&#39;s making the request probably doesn&#39;t want all that data. We should design our API to provide a way for the client to paginate or filter the results. </p>\n<p>One way to do that is using query params. We have so far avoided query params in our URIs, but filtering and pagination is a good scenario to use them. One standard practice to provide pagination is to have two query params: starting point and page size. </p>\n<p>For example, consider this URI:</p>\n<p><code>/messages?offset=30&amp;limit=10</code></p>\n<p>This URI fetches messages starting from message number 30 and returns the next 10 messages. The offset and limit params correspond to the start and page size values. The offset param tells you where client wants to start, and the limit tells you how many records the client wants. This, of course, assumes a specific order in which messages are returned, whether it is chronological or ID based. You as an API developer needs to make sure that the order that&#39;s returned is the same: The order in which you responded to the request for the first page should be retained in the requests for the second page.</p>\n<p>The client who uses your API might have their own logic for displaying pagination controls on their UI. But they would use these two params to make calls to the RESTful service to get chunks of data in pages.</p>\n<p>You can also choose to implement other kinds of filters using query params. Take an example of retrieving messages based on date. Let&#39;s say you want to provide an ability for clients to retrieve messages posted in a given year. You could have them send request like this:</p>\n<p><code>/messages?year=2014</code></p>\n<p>This returns all messages made in the year 2014. This is of course, something you can use together with pagination like this:</p>\n<p><code>/messages?year=2014&amp;offset=50&amp;limit=25</code></p>\n<h2 id=\"summary\">Summary</h2>\n<p>There are two types of REST URIs. One is instance resource URIs that identify a specific resource, and the other is collection URI which represent a collection of resources. Collection URIs usually end in plurals, like <em>messages</em>, <em>comments</em>, <em>products</em> and so on, and are typically a portion of the resource URI. An instance resource URI identify a specific resource below a collection resource URI.</p>\n<p>And finally, you can implement query params as a way of achieving pagination and filtering when accessing collection URIs.</p>\n<p>I encourage you to do the exercises where you&#39;ll practice writing RESTful URIs for collection resources. I&#39;ll see you in the next video.</p>\n","type":"video","durationText":"7 minutes","topic":"javaee","unit":{"lessons":[{"title":"Introduction","description":"Welcome to this course. This tutorial introduces you to REST APIs and explains some basic concepts.","permalinkName":"Introduction","type":"video","slNo":1,"durationText":"16 minutes"},{"title":"REST and HTTP","description":"In this tutorial, we will learn some HTTP concepts that have influenced REST.","permalinkName":"REST-and-HTTP","type":"video","slNo":2,"durationText":"14 minutes"},{"title":"HTTP Concepts","description":"In this tutorial, we will learn some HTTP concepts that have influenced REST.","permalinkName":"HTTP-Concepts","type":"quiz","slNo":3,"durationText":"5 questions"},{"title":"Designing Resource URIs","description":"In this tutorial, we’ll start designing a sample RESTful API for our sample social media application. And through the process, we’ll understand how RESTful URIs are designed.","permalinkName":"Designing-Resource-URIs","type":"video","slNo":4,"durationText":"18 minutes"},{"title":"Resource URIs Quiz","description":"In this tutorial, we’ll start designing a sample RESTful API for our sample social media application. And through the process, we’ll understand how RESTful URIs are designed.","permalinkName":"Resource-URIs-Quiz","type":"quiz","slNo":5,"durationText":"3 questions"},{"title":"RESTful URI types","description":"You can think of RESTful URIs as belonging to two types: instance resource URIs and collection resource URIs. Let's understand what they mean.","permalinkName":"RESTful-URI-types","type":"video","slNo":6,"durationText":"7 minutes"},{"title":"URI types","description":"You can think of RESTful URIs as belonging to two types: instance resource URIs and collection resource URIs. Let's understand what they mean.","permalinkName":"URI-types","type":"quiz","slNo":7,"durationText":"4 questions"},{"title":"HTTP Methods","description":"Now that we've identified some important resource URIs, let's work on the operations that can be performed and the data that's exchanged.","permalinkName":"HTTP-Methods","type":"video","slNo":8,"durationText":"11 minutes"},{"title":"HTTP Methods Quiz","description":"Now that we've identified some important resource URIs, let's work on the operations that can be performed and the data that's exchanged.","permalinkName":"HTTP-Methods-Quiz","type":"quiz","slNo":9,"durationText":"3 questions"},{"title":"Idempotence In HTTP Methods","description":"Idempotence. Yes, that's a word. And it's an important property of HTTP methods according to the specifications.","permalinkName":"Idempotence-In-HTTP-Methods","type":"video","slNo":10,"durationText":"12 minutes"},{"title":"Rest Response","description":"We've looked at requests so far, and understood resource URIs and HTTP methods. Let's switch to responses now.","permalinkName":"Rest-Response","type":"video","slNo":11,"durationText":"16 minutes"},{"title":"HATEOAS","description":"In this tutorial, we'll learn about an important concept relating to REST APIs: HATEOAS\n","permalinkName":"HATEOAS","type":"video","slNo":12,"durationText":"14 minutes"},{"title":"The Richardson Maturity Model","description":"In this tutorial, we'll learn about the Richardson Maturity Model, a way for REST APIs to be classified, and the \"RESTfulness\" of an API determined.","permalinkName":"The-Richardson-Maturity-Model","type":"video","slNo":13,"durationText":"8 minutes"}]}}